tylertms/dspic33e-sim/src/dspic33_internal.h
#ifndef DSPIC33E_SIM_DSPIC33_INTERNAL_H
#define DSPIC33E_SIM_DSPIC33_INTERNAL_H

#include "dspic33.h"

struct Dspic33 {
    uint32_t* program;
    uint32_t* auxiliary_program;
    uint32_t* persistent_program;
    uint32_t write_latches[DSPIC33_WRITE_LATCH_WORDS];
    uint8_t* data;
    uint8_t configuration[DSPIC33_CONFIGURATION_SIZE];
    uint16_t w[16];
    uint16_t shadow_w[4];
    uint16_t initialized_working_registers;
    uint16_t shadow_status;
    int64_t accumulator[2];
    uint32_t pc;
    uint16_t sr;
    uint16_t corcon;
    uint16_t splim;
    bool splim_enabled;
    uint16_t rcount;
    uint16_t dcount;
    uint32_t dostart;
    uint32_t doend;
    uint16_t tblpag;
    uint16_t dsrpag;
    uint16_t dswpag;
    uint16_t disicnt;
    uint16_t call_depth;
    uint8_t interrupt_depth;
    uint8_t repeat_active;
    bool repeat_psv_started;
    bool repeat_psv_reentry;
    uint8_t do_depth;
    uint32_t repeat_pc;
    uint32_t do_start[4];
    uint32_t do_end[4];
    uint16_t do_count[4];
    uint8_t do_terminate[4];
    uint64_t nested_do_interrupt_cycle;
    uint32_t nested_do_interrupt_end;
    uint32_t nested_do_extra_decrement_end;
    uint8_t nested_do_interrupt_depth;
    uint8_t nested_do_interrupt_priority;
    uint8_t nested_do_extra_decrement_depth;
    bool nested_do_interrupt_armed;
    uint16_t flash_read_connecting_words;
    bool flash_read_erratum_armed;
    bool flash_read_erratum_candidate;
    bool flash_read_connecting_ends_repeat;
    bool instruction_rmw;
    bool instruction_rmw_read_valid;
    uint32_t instruction_rmw_read_address;
    uint8_t instruction_rmw_read_width;
    uint8_t* var_write_domains;
    uint64_t instructions;
    uint64_t cycles;
    uint64_t device_cycles;
    uint32_t unsupported_opcode;
    uint16_t last_interrupt;
    uint32_t last_interrupt_return;
    uint64_t interrupt_count;
    uint64_t software_reset_count;
    uint64_t illegal_reset_count;
    uint64_t trap_count;
    uint32_t last_trap_return;
    uint16_t reset_interrupt;
    uint16_t last_trap;
    Dspic33PendingSoftTrap pending_soft_traps[4];
    uint32_t address_error_return;
    uint32_t current_instruction_pc;
    bool instruction_active;
    bool instruction_advancing;
    bool interrupt_entry_active;
    uint8_t interrupt_entry_overlap;
    uint8_t current_instruction_cycles;
    uint16_t instruction_working_register_writes;
    uint16_t instruction_source_address_registers;
    uint16_t previous_working_register_writes;
    bool non_cpu_sfr_read;
    bool psv_read;
    bool psv_repeat_optimized;
    bool address_error;
    bool address_error_access_allowed;
    bool address_error_working_state_completed;
    bool address_error_accumulator_state_completed;
    bool address_error_control_state_completed;
    uint32_t sequential_program_hole_pc;
    bool reset_occurred;
    bool reset_instruction_timing;
    bool illegal_reset;
    bool reset_locked;
    bool stop_on_trap;
    bool async_events_enabled;
    uint16_t interrupt_log_irq[16];
    uint32_t interrupt_log_entry[16];
    uint32_t interrupt_log_return[16];
    uint16_t interrupt_deferred[DSPIC33_IRQ_GROUP_COUNT];
    uint16_t interrupt_deferred_next[DSPIC33_IRQ_GROUP_COUNT];
    uint8_t gie_disable_deferred;
    uint8_t gie_disable_deferred_next;
    Dspic33Nvm nvm;
    Dspic33Oscillator oscillator;
    Dspic33Watchdog watchdog;
    Dspic33EventQueue events;
    uint8_t qei_inputs[DSPIC33_QEI_COUNT];
    Dspic33Io io;
    Dspic33PowerState power_state;
    Dspic33StopReason stop_reason;
};

bool dspic33_initialize(Dspic33* cpu);
void dspic33_release(Dspic33* cpu);

#endif
